import KirillImage from "../../assets/teamImages/Kirill.png";
import RiImage from "../../assets/teamImages/Ri.png";
import AdeleImage from "../../assets/teamImages/Adele.png";
import VictoriaImage from "../../assets/teamImages/Victoria.png";
import JuliaImage from "../../assets/teamImages/Julia.png";
import EkaterinaImage from "../../assets/teamImages/Ekaterina.png";
import DanilaImage from "../../assets/teamImages/Danila.png";
import ArtemImage from "../../assets/teamImages/Artem.png";
import VanyaImage from "../../assets/teamImages/Vanya.png";

export const teamArray = [
  {
    id: 1,
    image: KirillImage,
    name: "Кирилл",
    info: (
      <>
        Привет! Меня зовут Кирилл,<br /> я UX/UI дизайнер. <br />
        Мне нравится создавать<br /> удобные и понятные<br /> интерфейсы.
        Делать сайты <br />привлекательными<br />и запоминающимися.
        Умею<br /> анализировать рынок, строить<br /> CJM, user flow, чтобы лучше<br />
        понять потребности <br />пользователей и создать<br /> более удобный и интуитивно <br />понятный интерфейс сайта.<br />
        "Сила дизайна — в простоте <br />и эффективности."
      </>
    ),
    verticalText: 'UX/UI'
  },
  {
    id: 2,
    image: RiImage,
    name: "Виктория",
    info: (
      <>
        Меня зовут Виктория. Я <br />занимаюсь графическим <br />дизайном.
        Помогу вам <br />реализовать все ваши идеи <br />в области дизайна.
        Создам <br /> для вас как дизайн сайта<br /> и фирменный стиль,<br />
        так и баннеры, логотипы<br /> и оформления для соцсетей.<br />
        Моя цель — сделать ваш<br /> дизайн не только красивым, <br />но и эффективным, чтобы он<br /> привлекал внимание<br /> и выделялся на фоне<br /> конкурентов.
      </>
    ),
    verticalText: 'graph'
  },
  {
    id: 3,
    image: AdeleImage,
    name: "Адель",
    info: (
      <>
        Меня зовут Адель, и я - <br />заядлый backend-<br />разработчик.
        Скажу вам<br /> по секрету, я обожаю кодить!<br /> У меня за плечами
        большой <br />опыт, а мои знания - это<br /> настоящая сокровищница,
        которую я постоянно<br /> пополняю.
        Я всегда стремлюсь <br />к тому, чтобы все мои проекты<br />
        были максимально<br /> качественными, а клиенты - <br />довольными.
        Мне нравится <br />создавать что-то новое,<br /> поэтому я с удовольствием<br />
        помогу воплотить ваши идеи <br />в жизнь!
      </>
    ),
    verticalText: 'back'
  },
  {
    id: 4,
    image: VictoriaImage,
    name: "Виктория",
    info: (
      <>
        Хай, я Виктория, занимаюсь<br /> анимацией, создаю движение<br /> из
        статичной картинки, <br />а в какой-то степени<br /> принимаю участие и в её<br /> создании. Работаю больше <br />с 2D, но без 3D в проектах<br /> порой тоже не обойтись.<br />
        Если есть идея, то всегда буду <br />стараться претворить её <br />в достойный результат!
      </>
    ),
    verticalText: 'motion'
  },
  {
    id: 5,
    image: JuliaImage,
    name: "Юля",
    info: (
      <>
        Привет, я Юля — графический<br /> дизайнер, помогу воплотить <br />любые ваши идеи в жизнь,<br />
        создав что-то прекрасное.<br />
        Люблю креативить и изучать<br /> что-то новое. Работаю с <br />дизайном сайтов, логотипов,<br /> социальных сетей, карточек <br />товаров. Владею Photoshop,<br /> Illustrator, InDesign, After <br />Effects, а также Figma.
      </>
    ),
    verticalText: 'graph'
  },
  {
    id: 6,
    image: EkaterinaImage,
    name: "Екатерина",
    info: (
      <>
        Меня зовут Екатерина, я<br /> фронтенд-разработчик. Моя<br /> страсть — создание<br /> современных,
        интерактивных<br /> и отзывчивых веб-<br />приложений.
        Я владею такими<br /> технологиями, как HTML, CSS,<br /> JavaScript, и активно<br /> использую фреймворки<br /> и библиотеки, включая React.<br />
        Мой опыт также включает<br /> работу с системами контроля<br /> версий (Git) и инструментами <br />для сборки и оптимизации <br />проектов.
      </>
    ),
    verticalText: 'front'
  },
  {
    id: 7,
    image: DanilaImage,
    name: "Данила",
    info: (
      <>
        Привет! Меня зовут Данила.<br /> Я Frontend-разработчик.<br />
        Мой стек технологий: HTML,<br /> CSS, Sass, JavaScript, <br />TypeScript, Git, React и Vite.<br />
        Мне интересно работать<br /> над проектами, которые <br />позволяют создавать удобные и<br />
        эффективные интерфейсы<br /> для пользователей.
      </>
    ),
    verticalText: 'front'
  },
  {
    id: 8,
    image: ArtemImage,
    name: "Артем",
    info: (
      <>
        Меня зовут Артём, я SEO <br />специалист, занимаюсь <br />продвижением сайтов, выводя<br /> их в топы поисковых систем,<br /> а также увеличивая<br /> количество запросов<br /> и посещений.<br />
        Мне нравится заниматься<br /> своим делом, потому что оно<br /> понятно и нужно каждому<br /> проекту,
        который ищет<br /> способы повышения охвата <br />и узнаваемости в интернете.<br />
        "Долговечность успеха —<br />конкурентоспособность <br />и постоянное<br />самосовершенствование".
      </>
    ),
    verticalText: 'seo'
  },
  {
    id: 9,
    image: VanyaImage,
    name: "Иван",
    info: (
      <>
        Меня зовут Иван, и я рад <br />приветствовать вас от лица <br />нашей команды. Я являюсь <br />бэкенд-разработчиком<br /> и посвящаю себя созданию<br /> надёжных,
        эффективных <br />и масштабируемых решений <br />для вашего бизнеса.
        Я <br />стремлюсь к тому, чтобы<br /> каждая линия кода, которую я <br />пишу, служила вашим целям<br /> и помогала достигать новых <br />высот.
      </>
    ),
    verticalText: 'back'
  }
];
