import KirillImage from "../../assets/teamImages/Kirill.png";
import RiImage from "../../assets/teamImages/Ri.png";
import AdeleImage from "../../assets/teamImages/Adele.png";
import VictoriaImage from "../../assets/teamImages/Victoria.png";
import JuliaImage from "../../assets/teamImages/Julia.png";
import EkaterinaImage from "../../assets/teamImages/Ekaterina.png";
import DanilaImage from "../../assets/teamImages/Danila.png";
import ArtemImage from "../../assets/teamImages/Artem.png";
import VanyaImage from "../../assets/teamImages/Vanya.png";

export const teamArray = [
  {
    id: 1,
    image: KirillImage,
    name: "Кирилл",
    info: `Привет! меня зовут Кирилл, я UX/UI дизайнер.
          Мне нравится создавать удобные и понятные интерфейсы.
          Делать сайты привлекательными и запоминающимися.
          Умею анализировать рынок, строить CJM , user flow, чтобы лучше понять потребности пользователей и создать более удобный и интуитивно понятный интерфейс сайта.
          "Сила дизайна — в простоте и эффективности.`,
           verticalText: 'UX/UI'
  },
  {
    id: 2,
    image: RiImage,
    name: "Виктория",
    info: `Меня зовут Виктория, и я занимаюсь графическим дизайном.
          Помогу вам реализовать все ваши идеи в области дизайна.
          Я могу создать для вас как дизайн сайта и фирменный стиль, так и баннеры, логотипы и оформления для соцсетей.
          Я постоянно слежу за актуальными трендами в мире дизайна, чтобы предложить вам свежие и стильные решения.
          Моя задача — сделать ваш дизайн не только красивым, но и эффективным, чтобы он привлекал внимание и выделялся на фоне конкурентов.`,
          verticalText: 'graph'
  },
  {
    id: 3,
    image: AdeleImage,
    name: "Адель",
    info: `Меня зовут Адель, и я - заядлый backend-разработчик.
          Скажу вам по секрету, я обожаю кодить! У меня за плечами большой опыт, а мои знания - это настоящая сокровищница, которую я постоянно пополняю. 
          Я всегда стремлюсь к тому, чтобы все мои проекты были максимально качественными, а клиенты - довольными.
          Мне нравится создавать что-то новое, поэтому я с удовольствием помогу воплотить ваши идеи в жизнь!  Не бойтесь обращаться, я открыт к сотрудничеству с любыми проектами.`,
          verticalText: 'back'
  },
  {
    id: 4,
    image: VictoriaImage,
    name: "Виктория",
    info: `Хай, я Виктория, занимаюсь анимацией, создаю движение из статичной картинки, а в какой-то степени принимаю участие и в её создании.
          Работаю больше с 2д, но без 3д в проектах порой тоже не обойтись. 
          Если есть идея, то всегда буду стараться претворить её в достойный результат!`,
          verticalText: 'motion'
  },
  {
    id: 5,
    image: JuliaImage,
    name: "Юля",
    info: `Привет, я Юля — графический дизайнер, помогу воплотить любые ваши идеи в жизнь, создав что-то прекрасное.
          Люблю креативить и изучать что-то новое.Работаю с дизайном сайтов, логотипов, социальных сетей, карточек товаров.
          Владею Photoshop, Illustrator, InDesign, After Effects, а также Figma.`,
          verticalText: 'graph'
  },
  {
    id: 6,
    image: EkaterinaImage,
    name: "Екатерина",
    info: `Меня зовут Екатерина, я фронтенд-разработчик. Моя страсть — создание современных, интерактивных и отзывчивых веб-приложений.
          Я владею такими технологиями, как HTML, CSS, JavaScript, и активно использую фреймворки и библиотеки, включая React.
          Мой опыт также включает работу с системами контроля версий (Git) и инструментами для сборки и оптимизации проектов.`,
          verticalText: 'front'
  },
  {
    id: 7,
    image: DanilaImage,
    name: "Данила",
    info: `Привет! Меня зовут, Данила. я Frontend-разработчик. 
          Мой стек технологий: HTML, CSS, Sass, JavaScript, TypeScript, Git, React и Vite.
          Мне интересно работать над интересными проектами, которые позволяют создавать удобные и эффективные интерфейсы для пользователей.`,
          verticalText: 'front'
  },
  {
    id: 8,
    image: ArtemImage,
    name: "Артем",
    info: `Меня зовут Артём, я SEO специалист, занимаюсь продвижением сайтов, выводя их в топы поисковых систем, а также увеличивая количество запросов и посещений. 
          Мне нравится заниматься своим делом, потому что оно понятно и нужно каждому проекту, который ищет способы повышения охвата и узнаваемости в интернете.
          "Долговечность успеха - конкурентоспособность и постоянное самосовершенствование".`,
          verticalText: 'seo'
  },
  {
    id: 9,
    image: VanyaImage,
    name: "Иван",
    info: `Меня зовут Иван, и я рад приветствовать вас от лица нашей команды.
          Я являюсь бэкенд-разработчиком и посвящаю себя созданию надёжных, эффективных и масштабируемых решений для вашего бизнеса.
          Я стремлюсь к тому, чтобы каждая линия кода, которую я пишу, служила вашим целям и помогала достигать новых высот.`,
          verticalText: 'back'
  },
];
