import KirillImage from "../../assets/teamImages/Kirill.png";
import RiImage from "../../assets/teamImages/Ri.png";
import AdeleImage from "../../assets/teamImages/Adele.png";
import VictoriaImage from "../../assets/teamImages/Victoria.png";
import JuliaImage from "../../assets/teamImages/Julia.png";
import EkaterinaImage from "../../assets/teamImages/Ekaterina.png";
import DanilaImage from "../../assets/teamImages/Danila.png";
import ArtemImage from "../../assets/teamImages/Artem.png";
import VanyaImage from "../../assets/teamImages/Vanya.png";

export const teamArrayMobile = [
  {
    id: 1,
    image: KirillImage,
    name: "Кирилл",
    info: (
      <>
        Привет! Меня зовут Кирилл, я UX/UI дизайнер. <br />
        Мне нравится создавать удобные и понятные<br /> интерфейсы.
        Делать сайты<br /> привлекательнымии запоминающимися.<br />
        Умею анализировать рынок, строить CJM,<br /> user flow, чтобы лучше
        понять потребности<br /> пользователей и создать более удобный <br />и интуитивно понятный интерфейс сайта.<br />
        "Сила дизайна — в простоте<br /> и эффективности."
      </>
    ),
    verticalText: 'UX/UI'
  },
  {
    id: 2,
    image: RiImage,
    name: "Виктория",
    info: (
      <>
        Меня зовут Виктория. Я занимаюсь<br /> графическим дизайном.
        Помогу вам<br /> реализовать все ваши идеи в области <br />дизайна.
        Создам  для вас как дизайн сайта <br />и фирменный стиль,
        так и баннеры, логотипы <br />и оформления для соцсетей.
        Моя цель — <br />сделать ваш дизайн не только красивым,<br /> но и эффективным, чтобы он привлекал <br />внимание и выделялся на фоне конкурентов.
      </>
    ),
    verticalText: 'graph'
  },
  {
    id: 3,
    image: AdeleImage,
    name: "Адель",
    info: (
      <>
        Меня зовут Адель, и я - заядлый backend-<br />разработчик.
        Скажу вам по секрету, я обожаю<br /> кодить! У меня за плечами
        большой опыт,<br /> а мои знания - это настоящая сокровищница,<br />
        которую я постоянно пополняю.
        Я всегда <br />стремлюсь к тому, чтобы все мои проекты<br />
        были максимально качественными, а клиенты <br />- довольными.
        Мне нравится создавать что-то<br /> новое, поэтому я с удовольствием
        помогу<br /> воплотить ваши идеи в жизнь! Не бойтесь <br /> обращаться, я открыт к сотрудничеству<br />  с любыми проектами.
      </>
    ),
    verticalText: 'back'
  },
  {
    id: 4,
    image: VictoriaImage,
    name: "Виктория",
    info: (
      <>
        Хай, я Виктория, занимаюсь анимацией,<br />  создаю движение из
        статичной картинки,<br />  а в какой-то степени принимаю участие и в её<br />  создании. Работаю больше с 2D, но без 3D<br />  в проектах порой тоже не обойтись.
        Если есть<br />  идея, то всегда буду стараться претворить её<br />  в достойный результат!
      </>
    ),
    verticalText: 'motion'
  },
  {
    id: 5,
    image: JuliaImage,
    name: "Юля",
    info: (
      <>
        Привет, я Юля — графический дизайнер,<br />  помогу воплотить любые ваши идеи в жизнь,<br /> 
        создав что-то прекрасное.
        Люблю креативить<br />  и изучать что-то новое. Работаю с дизайном <br /> сайтов, логотипов, социальных сетей,<br />  карточек товаров. Владею Photoshop,<br />  Illustrator, InDesign, After Effects, а также Figma.
      </>
    ),
    verticalText: 'graph'
  },
  {
    id: 6,
    image: EkaterinaImage,
    name: "Екатерина",
    info: (
      <>
        Меня зовут Екатерина, я фронтенд-<br /> разработчик. Моя страсть — создание<br />  современных,
        интерактивных и отзывчивых<br />  веб-приложений.
        Я владею такими<br />  технологиями, как HTML, CSS, JavaScript,<br />  и активно использую фреймворки<br />  и библиотеки, включая React.
        Мой опыт также<br />  включает работу с системами контроля<br />  версий (Git) и инструментами для сборки <br /> и оптимизации проектов.
      </>
    ),
    verticalText: 'front'
  },
  {
    id: 7,
    image: DanilaImage,
    name: "Данила",
    info: (
      <>
        Привет! Меня зовут Данила. Я Frontend-<br /> разработчик.
        Мой стек технологий: HTML, CSS,<br />  Sass, JavaScript, TypeScript, Git, React и Vite.<br /> 
        Мне интересно работать над проектами,<br />  которые позволяют создавать удобные и
        эффективные интерфейсы <br />для пользователей.
      </>
    ),
    verticalText: 'front'
  },
  {
    id: 8,
    image: ArtemImage,
    name: "Артем",
    info: (
      <>
        Меня зовут Артём, я SEO специалист,<br />  занимаюсь продвижением сайтов, выводя их<br />  в топы поисковых систем, а также увеличивая <br /> количество запросов и посещений.<br /> 
        Мне нравится заниматься своим делом,<br />  потому что оно понятно и нужно каждому<br />  проекту,
        который ищет способы повышения<br />  охвата и узнаваемости в интернете.<br /> 
        "Долговечность успеха — <br /> конкурентоспособность и постоянное <br /> самосовершенствование".
      </>
    ),
    verticalText: 'seo'
  },
  {
    id: 9,
    image: VanyaImage,
    name: "Иван",
    info: (
      <>
        Меня зовут Иван, и я рад приветствовать вас<br />  от лица нашей команды. Я являюсь бэкенд-<br /> разработчиком и посвящаю себя созданию<br />  надёжных,
        эффективных и масштабируемых<br />  решений для вашего бизнеса.
        Я стремлюсь <br /> к тому, чтобы каждая линия кода, которую <br /> я пишу, служила вашим целям и помогала<br />  достигать новых высот.
      </>
    ),
    verticalText: 'back'
  }
];
